Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.9.116/atdf/ATSAML10D16A.atdf
        <register name="SEQCTRL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Sequence Control">
          <bitfield name="SEQEN" caption="Enable Positive Input in the Sequence" mask="0xFFFFFFFF"/>
        </register>
        <register name="CALIB" offset="0x2C" rw="RW" size="2" initval="0x0000" caption="Calibration">
          <bitfield name="BIASCOMP" caption="Bias Comparator Scaling" mask="0x7"/>
          <bitfield name="BIASREFBUF" caption="Bias  Reference Buffer Scaling" mask="0x700"/>
        </register>
      </register-group>
      <value-group name="ADC_CTRLB__PRESCALER">
        <value name="DIV2" caption="Peripheral clock divided by 2" value="0x0"/>
        <value name="DIV4" caption="Peripheral clock divided by 4" value="0x1"/>
        <value name="DIV8" caption="Peripheral clock divided by 8" value="0x2"/>
        <value name="DIV16" caption="Peripheral clock divided by 16" value="0x3"/>
        <value name="DIV32" caption="Peripheral clock divided by 32" value="0x4"/>
        <value name="DIV64" caption="Peripheral clock divided by 64" value="0x5"/>
        <value name="DIV128" caption="Peripheral clock divided by 128" value="0x6"/>
        <value name="DIV256" caption="Peripheral clock divided by 256" value="0x7"/>
      </value-group>
      <value-group name="ADC_REFCTRL__REFSEL">
        <value name="INTREF" caption="Internal Bandgap Reference" value="0x0"/>
        <value name="INTVCC0" caption="1/1.6 VDDANA" value="0x1"/>
        <value name="INTVCC1" caption="1/2 VDDANA" value="0x2"/>
        <value name="VREFA" caption="External Reference" value="0x3"/>
        <value name="VREFB" caption="External Reference" value="0x4"/>
        <value name="INTVCC2" caption="VDDANA" value="0x5"/>
      </value-group>
      <value-group name="ADC_INPUTCTRL__MUXNEG">
        <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
        <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
        <value name="GND" caption="Internal Ground" value="0x18"/>
      </value-group>
      <value-group name="ADC_INPUTCTRL__MUXPOS">
        <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
        <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
        <value name="TEMP" caption="Temperature Sensor" value="0x18"/>
        <value name="BANDGAP" caption="Bandgap Voltage" value="0x19"/>
        <value name="SCALEDVDDCORE" caption="1/4 Scaled VDDCORE Supply" value="0x1A"/>
        <value name="SCALEDVDDANA" caption="1/4 Scaled VDDANA Supply" value="0x1B"/>
        <value name="DAC" caption="DAC Output" value="0x1C"/>
        <value name="SCALEDVDDIO" caption="1/4 Scaled VDDIO Supply" value="0x1D"/>
        <value name="OPAMP01" caption="OPAMP0 or OPAMP1 output" value="0x1E"/>
        <value name="OPAMP2" caption="OPAMP2 output" value="0x1F"/>
      </value-group>
      <value-group name="ADC_CTRLC__DUALSEL">
        <value name="BOTH" caption="Start event or software trigger will start a conversion on both ADCs" value="0"/>
        <value name="INTERLEAVE" caption="START event or software trigger will alternatingly start a conversion on ADC0 and ADC1" value="1"/>
      </value-group>
      <value-group name="ADC_CTRLC__RESSEL">
        <value name="12BIT" caption="12-bit result" value="0x0"/>
        <value name="16BIT" caption="Accumulation or Oversampling and Decimation modes" value="0x1"/>
        <value name="10BIT" caption="10-bit result" value="0x2"/>
        <value name="8BIT" caption="8-bit result" value="0x3"/>
      </value-group>
      <value-group name="ADC_CTRLC__WINMODE">
        <value name="DISABLE" caption="No window mode (default)" value="0"/>
        <value name="MODE1" caption="RESULT &gt; WINLT" value="1"/>
        <value name="MODE2" caption="RESULT &lt; WINUT" value="2"/>
        <value name="MODE3" caption="WINLT &lt; RESULT &lt; WINUT" value="3"/>
        <value name="MODE4" caption="!(WINLT &lt; RESULT &lt; WINUT)" value="4"/>
      </value-group>
      <value-group name="ADC_AVGCTRL__SAMPLENUM">
        <value name="1" caption="1 sample" value="0x0"/>
        <value name="2" caption="2 samples" value="0x1"/>
        <value name="4" caption="4 samples" value="0x2"/>
        <value name="8" caption="8 samples" value="0x3"/>
        <value name="16" caption="16 samples" value="0x4"/>
        <value name="32" caption="32 samples" value="0x5"/>
        <value name="64" caption="64 samples" value="0x6"/>
        <value name="128" caption="128 samples" value="0x7"/>
        <value name="256" caption="256 samples" value="0x8"/>
        <value name="512" caption="512 samples" value="0x9"/>
        <value name="1024" caption="1024 samples" value="0xA"/>
      </value-group>
    </module>
    <module name="CCL" id="U2225" version="1.1.0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CCL_CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CCL_CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CCL_CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="1" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="2" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="CCL_LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="CCL_LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="CCL_LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="CCL_LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="CCL_LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is  required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
